START_MESSAGE = (
    "📚 Добро пожаловать в библиотеку!\n"
    "Используйте кнопки ниже для навигации."
)

CATALOG_WELCOME = "📚 Добро пожаловать в каталог!"
CATALOG_CHOOSE_GENRE = "🔎 Выберите жанр из списка:"
CATALOG_NO_GENRES = "📭 Пока жанров нет."
CATALOG_NO_BOOKS = "📭 В этом жанре пока нет книг."
CATALOG_CURRENT_GENRE = "📖 Книги в выбранном жанре:"
CATALOG_GENRE_CHOOSE_ERROR = "❗ Ошибка при выборе жанра. Пожалуйста, попробуйте ещё раз."

SEARCH_PROMPT = "🔍 Введите название книги для поиска:"
SEARCH_EMPTY_QUERY = "⚠️ Пустой запрос. Пожалуйста, введите название книги или автора."
SEARCH_NO_RESULTS = "⚠️ По запросу «{query}» ничего не найдено."
SEARCH_RESULT = "🔎 Результаты поиска по запросу:\n\n<i>{query}</i>"

BOOK_SELECT_FORMAT = "📥 Выберите формат книги:"
BOOK_DOWNLOAD_ERROR_DATA_NOT_FOUND = "⚠️ Ошибка в данных для загрузки файла."
BOOK_DOWNLOAD_ERROR_FILE_NOT_FOUND = "📁 Файл не найден!"
BOOK_READY_CAPTION = "Готово! Книга доступна для загрузки:\n\n<b>{book_name}</b> 📖"
BOOK_NAME = "{title} — {author}"
BOOK_UNKNOWN_BOOK = "📕 Неизвестная книга"

BUTTON_MENU_CATALOG = "📚 Каталог"
BUTTON_MENU_SEARCH = "🔎 Поиск"
BUTTON_BACK_TO_MAIN_MENU = "🏠 В главное меню"

KEYBOARD_PREV = "⬅️ Назад"
KEYBOARD_NEXT = "Вперёд ➡️"
KEYBOARD_BACK_TO_GENRE = "⬅️ К жанрам"
KEYBOARD_BACK_TO_SEARCH = "⬅️ К поиску"
KEYBOARD_PAGES = "{page}/{total_pages}"
KEYBOARD_NO_GENRES = "📭 Нет доступных жанров."
KEYBOARD_NO_FILES = "📁 Нет доступных файлов."
KEYBOARD_BOOK_NAME = "{title} — {author}"